#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.apim_itn.azurerm_api_management_named_value.app_func_key will be created
  + resource "azurerm_api_management_named_value" "app_func_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-wallet-user-func-create-wa-key"
      + id                  = (known after apply)
      + name                = "io-wallet-user-func-create-wa-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["leases-wallet-instances-user-id"] will be created
  + resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + database_name       = "db"
      + id                  = (known after apply)
      + name                = "leases-wallet-instances-user-id"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # module.cosmos.azurerm_cosmosdb_sql_container.containers_02["wallet-instances-user-id"] will be created
  + resource "azurerm_cosmosdb_sql_container" "containers_02" {
      + account_name        = "io-p-itn-wallet-cosno-02"
      + database_name       = "db"
      + id                  = (known after apply)
      + name                = "wallet-instances-user-id"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + throughput          = (known after apply)

      + autoscale_settings {
          + max_throughput = 8000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # module.apim_itn.module.apim_v2_wallet_app_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "App API to create wallet attestation"
      + display_name          = "IO Wallet - APP"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-wallet-app-api"
      + path                  = "api/v1/wallet/app"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-wallet-user-func-02.azurewebsites.net/api/v1/wallet"
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = jsonencode(
                {
                  + components = {
                      + responses       = {
                          + BadRequest           = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Validation error"
                            }
                          + Conflict             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "There has been a conflict"
                            }
                          + Forbidden            = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The server understands the request but refuses to authorize it"
                            }
                          + InternalServerError  = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Internal Server Error"
                            }
                          + NotFound             = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "The specified resource was not found"
                            }
                          + ServiceUnavailable   = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Service Unavailable"
                            }
                          + UnprocessableContent = {
                              + content     = {
                                  + "application/json" = {
                                      + schema = {
                                          + "$ref" = "#/components/schemas/ProblemJson"
                                        }
                                    }
                                }
                              + description = "Unprocessable Content"
                            }
                        }
                      + schemas         = {
                          + CreateWalletAttestationBody = {
                              + properties = {
                                  + assertion  = {
                                      + example   = "eyJhbGciOiJFUzI1NiIsImtpZCI6InZiZVhKa3NNNDV4cGh0QU5uQ2lHNm1DeXVVNGpmR056b3BHdUt2b2dnOWMiLCJ0eXAiOiJ3YXIrand0In0.eyJpc3MiOiJodHRwczovL3dhbGxldC1wcm92aWRlci5leGFtcGxlLm9yZy9pbnN0YW5jZS92YmVYSmtzTTQ1eHBodEFObkNpRzZtQ3l1VTRqZkdOem9wR3VLdm9nZzljIiwic3ViIjoiaHR0cHM6Ly93YWxsZXQtcHJvdmlkZXIuZXhhbXBsZS5vcmcvIiwiY2hhbGxlbmdlIjoiNmVjNjkzMjQtNjBhOC00ZTViLWE2OTctYTc2NmQ4NTc5MGVhIiwiaGFyZHdhcmVfc2lnbmF0dXJlIjoiS29aSWh2Y05BUWNDb0lBd2dBSUIuLi5yZWRhY3RlZCIsImludGVncml0eV9hc3NlcnRpb24iOiJvMk5tYlhSdllYQndiR1V0WVhCd1lYLi4ucmVkYWN0ZWQiLCJoYXJkd2FyZV9rZXlfdGFnIjoiV1FoeUR5bUZLc1A5NWlGcXB6ZEVEV1c0bDdhVm5hMkZuNEpDZVdIWXRiVT0iLCJjbmYiOnsiandrIjp7ImNydiI6IlAtMjU2Iiwia3R5IjoiRUMiLCJ4IjoiNEhOcHRJLXhyMnBqeVJKS0dNbno0V21kblFEX3VKU3E0Ujk1Tmo5OGI0NCIsInkiOiJMSVpuU0IzOXZGSmhZZ1MzazdqWEU0cjMtQ29HRlF3WnRQQklScXBObHJnIiwia2lkIjoidmJlWEprc000NXhwaHRBTm5DaUc2bUN5dVU0amZHTnpvcEd1S3ZvZ2c5YyJ9fSwidnBfZm9ybWF0c19zdXBwb3J0ZWQiOnsiand0X3ZjX2pzb24iOnsiYWxnX3ZhbHVlc19zdXBwb3J0ZWQiOlsiRVMyNTZLIiwiRVMzODQiXX0sImp3dF92cF9qc29uIjp7ImFsZ192YWx1ZXNfc3VwcG9ydGVkIjpbIkVTMjU2SyIsIkVkRFNBIl19fSwiaWF0IjoxNjg2NjQ1MTE1LCJleHAiOjE2ODY2NTIzMTV9.F32bisVth4eDdGxDjB9ByENT-oZLtSY_89uwTSePo2GMEKaeEedpXZE_9mrX7t0_Fmc5m6LNVvIIBqotqsYJYQ"
                                      + format    = "binary"
                                      + minLength = 1
                                      + type      = "string"
                                    }
                                  + grant_type = {
                                      + enum = [
                                          + "urn:ietf:params:oauth:grant-type:jwt-bearer",
                                        ]
                                      + type = "string"
                                    }
                                }
                              + required   = [
                                  + "grant_type",
                                  + "assertion",
                                ]
                              + type       = "object"
                            }
                          + ProblemJson                 = {
                              + properties = {
                                  + detail   = {
                                      + description = <<-EOT
                                            A human readable explanation specific to this occurrence of the
                                            problem.
                                        EOT
                                      + example     = "There was an error processing the request"
                                      + type        = "string"
                                    }
                                  + instance = {
                                      + description = "An absolute URI that identifies the specific occurrence of the problem. It may or may not yield further information if dereferenced."
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                  + status   = {
                                      + description      = "The HTTP status code generated by the origin server for this occurrence of the problem."
                                      + example          = 500
                                      + exclusiveMaximum = true
                                      + format           = "int32"
                                      + maximum          = 600
                                      + minimum          = 100
                                      + type             = "integer"
                                    }
                                  + title    = {
                                      + description = "A short, summary of the problem type. Written in english and readable for engineers (usually not suited for non technical stakeholders and not localized); example: Service Unavailable"
                                      + type        = "string"
                                    }
                                  + type     = {
                                      + default     = "about:blank"
                                      + description = <<-EOT
                                            An absolute URI that identifies the problem type. When dereferenced,
                                            it SHOULD provide human-readable documentation for the problem type
                                            (e.g., using HTML).
                                        EOT
                                      + example     = "https://example.com/problem/constraint-violation"
                                      + format      = "uri"
                                      + type        = "string"
                                    }
                                }
                              + type       = "object"
                            }
                          + WalletAttestationView       = {
                              + properties = {
                                  + wallet_attestation = {
                                      + format    = "binary"
                                      + minLength = 1
                                      + type      = "string"
                                    }
                                }
                              + required   = [
                                  + "wallet_attestation",
                                ]
                              + type       = "object"
                            }
                        }
                      + securitySchemes = {
                          + SubscriptionKey = {
                              + in   = "header"
                              + name = "Ocp-Apim-Subscription-Key"
                              + type = "apiKey"
                            }
                        }
                    }
                  + info       = {
                      + title   = "IO Wallet - APP API"
                      + version = "1.0.0"
                    }
                  + openapi    = "3.0.3"
                  + paths      = {
                      + "/wallet-attestation" = {
                          + post = {
                              + operationId = "createWalletAttestation"
                              + requestBody = {
                                  + content  = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/CreateWalletAttestationBody"
                                            }
                                        }
                                    }
                                  + required = true
                                }
                              + responses   = {
                                  + "200" = {
                                      + content     = {
                                          + "application/json" = {
                                              + schema = {
                                                  + "$ref" = "#/components/schemas/WalletAttestationView"
                                                }
                                            }
                                        }
                                      + description = "Wallet Attestation generated"
                                    }
                                  + "403" = {
                                      + "$ref"      = "#/components/responses/Forbidden"
                                      + description = "The wallet instance was revoked"
                                    }
                                  + "404" = {
                                      + "$ref"      = "#/components/responses/NotFound"
                                      + description = "The wallet instance was not found"
                                    }
                                  + "409" = {
                                      + "$ref" = "#/components/responses/Conflict"
                                    }
                                  + "422" = {
                                      + "$ref" = "#/components/responses/UnprocessableContent"
                                    }
                                  + "500" = {
                                      + "$ref" = "#/components/responses/InternalServerError"
                                    }
                                  + "503" = {
                                      + "$ref" = "#/components/responses/ServiceUnavailable"
                                    }
                                }
                              + security    = [
                                  + {
                                      + SubscriptionKey = []
                                    },
                                ]
                              + summary     = "Create and return a Wallet Attestation"
                            }
                        }
                    }
                }
            )
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_itn.module.apim_v2_wallet_app_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-app-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-wallet-user-func-create-wa-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.apim_itn.module.apim_v2_wallet_app_api.azurerm_api_management_product_api.this["io-p-wallet-app-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-wallet-app-api"
      + id                  = (known after apply)
      + product_id          = "io-p-wallet-app-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_itn.module.apim_v2_wallet_app_product.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product containing app APIs"
      + display_name          = "IO WALLET APP APIs"
      + id                    = (known after apply)
      + product_id            = "io-p-wallet-app-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
